Revit 2024 API
UIDocument.RefreshActiveView Method
Refresh the display of the active view in the active document.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2011
Syntax
C#
public void RefreshActiveView()
Visual Basic
Public Sub RefreshActiveView
Visual C++
public:
void RefreshActiveView()
See Also
UIDocument Class
Autodesk.Revit.UI Namespace